In [6]:
!pip install python-dotenv -q

In [7]:
GOOGLE_API_KEY="AIzaSyC2wwbtfXzeAOqS81zHYlGtJQcrE-KidHs"

In [9]:
from langchain_google_genai import GoogleGenerativeAI

# Directly set your Google API key
google_api_key = GOOGLE_API_KEY  # Replace with your actual Google API key

# Initialize the GoogleGenerativeAI model
llm = GoogleGenerativeAI(model="gemini-pro", google_api_key=GOOGLE_API_KEY)

In [11]:
print(llm("which is  better choosing a field in datascience or generative ai"))

**Data Science**

**Pros:**

* High demand in various industries
* Strong job market with competitive salaries
* Wide range of applications, from healthcare to finance
* Opportunities for specialization in areas like machine learning, big data, and data visualization
* Established field with a well-defined career path

**Cons:**

* Requires a strong foundation in math, statistics, and computer science
* Can be repetitive and time-consuming
* May face competition from offshore outsourcing

**Generative AI**

**Pros:**

* Emerging field with rapidly growing potential
* Ability to create novel content and applications
* Exciting and innovative work environment
* High earning potential for top talent
* Contributes to advancements in fields like art, music, and technology

**Cons:**

* Unproven job market and career path
* Requires specialized skills in deep learning and artificial intelligence
* Ethical concerns and potential for misuse
* May require a higher level of education and experience
* Still in its early stages of development

**Which is Better?**

The choice between data science and generative AI depends on your individual skills, interests, and career goals.

**Consider data science if:**

* You have a strong technical background and enjoy working with data
* You are interested in solving real-world problems using data
* You prefer a stable and established field

**Consider generative AI if:**

* You are passionate about creating new and innovative content
* You are interested in pushing the boundaries of artificial intelligence
* You are willing to invest in further education and specialization
* You are comfortable with the uncertainty and ethical challenges of a rapidly evolving field

Ultimately, both data science and generative AI offer exciting career opportunities. The key is to choose the field that best aligns with your skills and interests.

***#connect with database and ask some basic questions***

In [21]:
!pip install langchain_experimental -q

In [24]:
!pip install --upgrade langchain mysql-connector-python -q

ERROR: pip's dependency resolver does not currently take into account all the packages that are installed. This behaviour is the source of the following dependency conflicts.
langchain-google-genai 1.0.1 requires langchain-core<0.2,>=0.1, but you have langchain-core 0.3.15 which is incompatible.

In [36]:
from langchain.utilities import SQLDatabase

In [37]:
from langchain.chains import create_sql_query_chain

In [38]:
db_user="root"
db_password="9160"
db_host="localhost"
db_name="scott"
db=SQLDatabase.from_uri(f"mysql+pymysql://{db_user}:{db_password}@{db_host}/{db_name}",sample_rows_in_table_info=3)
print(db.table_info)

CREATE TABLE bonus (
	`ENAME` VARCHAR(10),
	`JOB` VARCHAR(9),
	`SAL` INTEGER,
	`COMM` INTEGER
)ENGINE=InnoDB COLLATE utf8mb4_0900_ai_ci DEFAULT CHARSET=utf8mb4

/*
3 rows from bonus table:
ENAME	JOB	SAL	COMM

*/


CREATE TABLE customers (
	cust_id INTEGER,
	cust_name CHAR(12),
	city CHAR(12)
)ENGINE=InnoDB COLLATE utf8mb4_0900_ai_ci DEFAULT CHARSET=utf8mb4

/*
3 rows from customers table:
cust_id	cust_name	city
101	King	Boston
102	Alex	seattle
103	Ben	Boston
*/


CREATE TABLE dept (
	`DEPTNO` INTEGER,
	`DNAME` VARCHAR(14),
	`LOC` VARCHAR(13)
)ENGINE=InnoDB COLLATE utf8mb4_0900_ai_ci DEFAULT CHARSET=utf8mb4

/*
3 rows from dept table:
DEPTNO	DNAME	LOC
10	ACCOUNTING	NEW YORK
20	RESEARCH	DALLAS
30	SALES	CHICAGO
*/


CREATE TABLE emp (
	`EMPNO` INTEGER NOT NULL,
	`ENAME` VARCHAR(10),
	`JOB` VARCHAR(9),
	`MGR` INTEGER,
	`HIREDATE` DATE,
	`SAL` INTEGER,
	`COMM` INTEGER,
	`DEPTNO` INTEGER
)ENGINE=InnoDB COLLATE utf8mb4_0900_ai_ci DEFAULT CHARSET=utf8mb4

/*
3 rows from emp table:
EMPNO	ENAME	JOB	MGR	HIREDATE	SAL	COMM	DEPTNO
7369	SMITH	CLERK	7902	1980-12-17	800	None	20
7499	ALLEN	SALESMAN	7698	1981-02-20	1600	300	30
7521	WARD	SALESMAN	7698	1981-02-22	1250	500	30
*/


CREATE TABLE medicines (
	med_id INTEGER,
	name CHAR(22),
	qty INTEGER
)ENGINE=InnoDB COLLATE utf8mb4_0900_ai_ci DEFAULT CHARSET=utf8mb4

/*
3 rows from medicines table:
med_id	name	qty
101	CROSIN	100
102	DOLO 650	19
*/


CREATE TABLE orders (
	med_id INTEGER,
	order_date DATETIME
)ENGINE=InnoDB COLLATE utf8mb4_0900_ai_ci DEFAULT CHARSET=utf8mb4

/*
3 rows from orders table:
med_id	order_date

*/


CREATE TABLE rakesh (
	id INTEGER NOT NULL AUTO_INCREMENT,
	name VARCHAR(50),
	age INTEGER,
	PRIMARY KEY (id)
)ENGINE=InnoDB COLLATE utf8mb4_0900_ai_ci DEFAULT CHARSET=utf8mb4

/*
3 rows from rakesh table:
id	name	age

*/


CREATE TABLE salgrade (
	`GRADE` INTEGER,
	`LOSAL` INTEGER,
	`HISAL` INTEGER
)ENGINE=InnoDB COLLATE utf8mb4_0900_ai_ci DEFAULT CHARSET=utf8mb4

/*
3 rows from salgrade table:
GRADE	LOSAL	HISAL
1	700	1200
2	1201	1400
3	1401	2000
*/

In [40]:
from langchain.chains import create_sql_query_chain


chain=create_sql_query_chain(llm,db)
response=chain.invoke({"question":"how many employees are there in emp table"})#invoking the chain
response

'```sql\nSELECT COUNT(*) AS num_employees\nFROM emp;\n```'

In [56]:
cleaned_query=response.strip("''```sql\n").strip("\n```'").replace("\n"," ")
cleaned_query

'SELECT COUNT(*) AS num_employees FROM emp;'

In [57]:
result=db.run(cleaned_query)
print(result)

[(14,)]

***CREATING A FUBCTION TO PERFORM QUERIE WITHOUT METIONING ALL CODE EVRY TIME***

In [1]:
from mysql.connector.errors import ProgrammingError  # Import ProgrammingError

def execute_query(question):
    try:
        # Generating SQL query from question
        response = chain.invoke({"question": question})  # Invoking the chain
        # Printing response
        print(response)
        print("#" * 50)
        # Clearing unwanted symbols and special characters from generated query
        cleaned_query = response.strip("''```sql\n").strip("\n```'").replace("\n", " ")
        # Printing cleaned query
        print(cleaned_query)
        print("#" * 50)
        # Executing the query and printing the result from database
        result = db.run(cleaned_query)
        # Printing result
        print(result)
    except ProgrammingError as e:
        print(f"An error occurred: {e}")

In [62]:
q1="top 5 salaries from emp"
execute_query(q1)

```sql
SELECT `ENAME`, `SAL`
FROM emp
ORDER BY `SAL` DESC
LIMIT 5;
```
##################################################
SELECT `ENAME`, `SAL` FROM emp ORDER BY `SAL` DESC LIMIT 5;
##################################################
[('KING', 5000), ('SCOTT', 3000), ('FORD', 3000), ('JONES', 2975), ('BLAKE', 2850)]

In [64]:
q1="total salary grouped by department from emp"
execute_query(q1)

```sql
SELECT
  d.`DNAME`,
  SUM(e.`SAL`) AS 'Total Salary'
FROM emp AS e
JOIN dept AS d
  ON e.`DEPTNO` = d.`DEPTNO`
GROUP BY
  d.`DNAME`;
```
##################################################
SELECT   d.`DNAME`,   SUM(e.`SAL`) AS 'Total Salary' FROM emp AS e JOIN dept AS d   ON e.`DEPTNO` = d.`DEPTNO` GROUP BY   d.`DNAME`;
##################################################
[('RESEARCH', Decimal('10875')), ('SALES', Decimal('9400')), ('ACCOUNTING', Decimal('8750'))]

In [66]:
q1="first joined person name in emp"
execute_query(q1)

```sql
SELECT `ENAME`
FROM emp
ORDER BY `EMPNO`
LIMIT 1;
```
##################################################
SELECT `ENAME` FROM emp ORDER BY `EMPNO` LIMIT 1;
##################################################
[('SMITH',)]